/*

Data structure - Binary Tree(Binary Search Tree)

+---------------------------------------------------------------------------------------+
|              ПРЕДМЕТНАЯ ОБЛАСТЬ – АВТОПАРК.											|
|  Основные возможности программы:														|
|  -  добавление элемента;																|
|  -  удаление элемента;																|
|  -  возможность корректировки данных;													|
|  -  вывод всех данных;																|
|  -  формирование списка автобусов, выехавших из парка (оставшихся в парке);			|
|  -  вывод данных о водителях с наибольшим числом нарушений;							|
|  -  сортировкa данных по номерам автобусов;											|
|  -  вывод всех фамилий водителей, начинающихся  на заданную букву.					|
|																						|
+---------------------------------------------------------------------------------------+
*/

#include "header.h"

void StartWindow() {
	cout << endl << endl;
	cout << "\t\t\t" << "::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::" << endl;
	cout << "\t\t\t" << "::                                                            ::" << endl;
	cout << "\t\t\t" << "::                       Курсовая работа                      ::" << endl;
	cout << "\t\t\t" << "::      по дисциплине: Алгоритмизация и программирование      ::" << endl;
	cout << "\t\t\t" << "::                   студента граппы: АИ-182                  ::" << endl;
	cout << "\t\t\t" << "::                        Суржикова Юрия                      ::" << endl;
	cout << "\t\t\t" << "::                                                            ::" << endl;
	cout << "\t\t\t" << "::                                                            ::" << endl;
	cout << "\t\t\t" << "::                           2019 год                         ::" << endl;
	cout << "\t\t\t" << "::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::" << endl;
	cout << endl 
		 << "\t\t\t";
	system("pause");
}

int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	//StartWindow();
	StartProgramm();
	while (true) {
		MainMenu();
	}
	return 0;
}